#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_storage_bucket.auto-expire: Refreshing state... [id=tuk-testing-auto-expiring-bucket-06]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_storage_bucket.auto-expire has been changed
  ~ resource "google_storage_bucket" "auto-expire" {
        id                          = "tuk-testing-auto-expiring-bucket-06"
      + labels                      = {}
        name                        = "tuk-testing-auto-expiring-bucket-06"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.auto-expire must be replaced
-/+ resource "google_storage_bucket" "auto-expire" {
      ~ bucket_policy_only          = false -> (known after apply)
      - default_event_based_hold    = false -> null
      ~ id                          = "tuk-testing-auto-expiring-bucket-06" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "tuk-testing-auto-expiring-bucket-06" -> "tuk-testing-auto-expiring-bucket-07" # forces replacement
      ~ project                     = "ian-harris-test01" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/tuk-testing-auto-expiring-bucket-06" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://tuk-testing-auto-expiring-bucket-06" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ lifecycle_rule {

          - condition {
              - age                        = 3 -> null
              - days_since_custom_time     = 0 -> null
              - days_since_noncurrent_time = 0 -> null
              - matches_storage_class      = [] -> null
              - num_newer_versions         = 0 -> null
              - with_state                 = "ANY" -> null
            }
          + condition {
              + age                   = 3
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @TrigpointingUK, Action: `pull_request`*